KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x.h
/**
  ******************************************************************************
  * @file    Parameters conversion_F30X.h
  * @author  STMicroelectronics - System Lab - MC Team
  * @version 4.0.0
  * @date    28-May-2014 10:45
  * @brief   This file implements the Parameter conversion on the base
  *          of stdlib F30x for the first drive
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PARAMETERS_CONVERSION_F30X_H
#define __PARAMETERS_CONVERSION_F30X_H

#include "Definitions.h"
#include "PMSM motor parameters.h"
#include "Drive parameters.h"
#include "Power stage parameters.h"
#include "Control stage parameters.h"
#include "stm32f30x.h"
#include "MC_Math.h"

#define SQRT_2  1.4142
#define SQRT_3  1.732

/************************* CPU & ADC PERIPHERAL CLOCK CONFIG ******************/

#ifndef ADC_CLOCK_WB_DIV
#define ADC_CLOCK_WB_DIV  1
#endif

#if (ADC_CLOCK_WB_DIV == 0)
#undef ADC_CLOCK_WB_DIV
#define ADC_CLOCK_WB_DIV 1
#endif

#if   (ADC_CLOCK_WB_DIV == 1)
#define ADC_CLOCK_DIVIDER  ADC_Clock_SynClkModeDiv1
#elif (ADC_CLOCK_WB_DIV == 2)
#define ADC_CLOCK_DIVIDER  ADC_Clock_SynClkModeDiv2
#elif (ADC_CLOCK_WB_DIV == 4)
#define ADC_CLOCK_DIVIDER  ADC_Clock_SynClkModeDiv4
#endif

#define ADC_CLOCK_DIV      ADC_CLOCK_WB_DIV

#ifdef CPU_CLK_72_MHZ
#define SYSCLK_FREQ_72MHz  72000000uL
#define TIM_CLOCK_DIVIDER  1
#define ADV_TIM_CLK_MHz    (72uL/TIM_CLOCK_DIVIDER)
#define ADC_CLK_MHz        (72uL/ADC_CLOCK_DIV)
#define HALL_TIM_CLK       SYSCLK_FREQ_72MHz

#elif defined CPU_CLK_56_MHZ
#define SYSCLK_FREQ_56MHz  56000000uL
#define TIM_CLOCK_DIVIDER  1
#define ADV_TIM_CLK_MHz    (56uL/TIM_CLOCK_DIVIDER)
#define ADC_CLK_MHz        (56uL/ADC_CLOCK_DIV)
#define HALL_TIM_CLK       SYSCLK_FREQ_56MHz
#error "The CPU frequency set in Contol stage parameters is not automatically configured in system_stm32f30x.c. Please configure it manually if you require to work with the selected CPU frequency. Once done, comment this line to avoid to show this messagge again."

#elif defined CPU_CLK_48_MHZ
#define SYSCLK_FREQ_48MHz  48000000uL
#define TIM_CLOCK_DIVIDER  1
#define ADV_TIM_CLK_MHz    (48uL/TIM_CLOCK_DIVIDER)
#define ADC_CLK_MHz        (48uL/ADC_CLOCK_DIV)
#define HALL_TIM_CLK       SYSCLK_FREQ_48MHz
#error "The CPU frequency set in Contol stage parameters is not automatically configured in system_stm32f30x.c. Please configure it manually if you require to work with the selected CPU frequency. Once done, comment this line to avoid to show this messagge again."

#elif defined CPU_CLK_24_MHZ
#define SYSCLK_FREQ_24MHz  24000000uL
#define TIM_CLOCK_DIVIDER  1
#define ADV_TIM_CLK_MHz    (24uL/TIM_CLOCK_DIVIDER)
#define ADC_CLK_MHz        (24uL/ADC_CLOCK_DIV)
#define HALL_TIM_CLK       SYSCLK_FREQ_24MHz
#error "The CPU frequency set in Contol stage parameters is not automatically configured in system_stm32f30x.c. Please configure it manually if you require to work with the selected CPU frequency. Once done, comment this line to avoid to show this messagge again."
#else
#error "Invalid configuration: The CPU frequency set in Contol stage parameters is not supported."
#endif

/************************* CONTROL FREQUENCIES & DELAIES **********************/
#define TF_REGULATION_RATE 	(uint16_t) ((uint16_t)(PWM_FREQUENCY)/REGULATION_EXECUTION_RATE)
#define REP_COUNTER 			(uint16_t) ((REGULATION_EXECUTION_RATE *2u)-1u)

#define MEDIUM_FREQUENCY_TASK_RATE	(uint16_t)SPEED_LOOP_FREQUENCY_HZ

#define INRUSH_CURRLIMIT_DELAY_COUNTS  (uint16_t)(INRUSH_CURRLIMIT_DELAY_MS * \
                                  ((uint16_t)SPEED_LOOP_FREQUENCY_HZ)/1000u -1u)

#define SYS_TICK_FREQUENCY          2000
#define UI_TASK_FREQUENCY_HZ        10
#define SERIAL_COM_TIMEOUT_INVERSE  25

#define MF_TASK_OCCURENCE_TICKS  (SYS_TICK_FREQUENCY/SPEED_LOOP_FREQUENCY_HZ)-1u
#define UI_TASK_OCCURENCE_TICKS  (SYS_TICK_FREQUENCY/UI_TASK_FREQUENCY_HZ)-1u
#define SERIALCOM_TIMEOUT_OCCURENCE_TICKS (SYS_TICK_FREQUENCY/SERIAL_COM_TIMEOUT_INVERSE)-1u


/*********************** SENSORLESS REV-UP PARAMETERS *************************/
#define FIRST_SLESS_ALGO_PHASE (ENABLE_SL_ALGO_FROM_PHASE-1u)  

#if OPEN_LOOP_FOC == ENABLE

#define OPEN_LOOP
#undef DEFAULT_TARGET_SPEED_RPM
#define DEFAULT_TARGET_SPEED_RPM       OPEN_LOOP_SPEED_RPM

#undef PHASE1_DURATION
#undef PHASE2_DURATION
#undef PHASE3_DURATION
#undef PHASE4_DURATION
#undef PHASE5_DURATION

#undef PHASE1_FINAL_SPEED_RPM
#undef PHASE2_FINAL_SPEED_RPM
#undef PHASE3_FINAL_SPEED_RPM
#undef PHASE4_FINAL_SPEED_RPM
#undef PHASE5_FINAL_SPEED_RPM

#undef VARIANCE_THRESHOLD
#undef CORD_VARIANCE_THRESHOLD

/* Phase 1 */
#define PHASE1_DURATION		        OPEN_LOOP_SPEED_RAMP_DURATION_MS
#define PHASE1_FINAL_SPEED_RPM	    OPEN_LOOP_SPEED_RPM

/* Phase 2 */
#define PHASE2_DURATION		      65535   /*milliseconds */
#define PHASE2_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

/* Phase 3 */
#define PHASE3_DURATION		       65535   /*milliseconds */
#define PHASE3_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

/* Phase 4 */
#define PHASE4_DURATION		  65535   /*milliseconds */
#define PHASE4_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

