KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x.h
/* Phase 5 */
#define PHASE5_DURATION		  65535    /* milliseconds */
#define PHASE5_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

#define VARIANCE_THRESHOLD 0
#define CORD_VARIANCE_THRESHOLD 0

#endif

/* Legacy for WB 4.0 Beta */
#if !defined(OPEN_LOOP_VF)
#define OPEN_LOOP_VF FALSE
#endif
#if !defined(OPEN_LOOP_OFF)
#define OPEN_LOOP_OFF 4400
#endif
#if !defined(OPEN_LOOP_K)
#define OPEN_LOOP_K 44
#endif

/************************* OBSERVER + PLL PARAMETERS **************************/
#define MAX_BEMF_VOLTAGE  (u16)((MAX_APPLICATION_SPEED * 1.2 *\
                           MOTOR_VOLTAGE_CONSTANT*SQRT_2)/(1000u*SQRT_3))

#if (BUS_VOLTAGE_READING == ENABLE)
/*max phase voltage, 0-peak Volts*/
#define MAX_VOLTAGE (int16_t)((MCU_SUPPLY_VOLTAGE/2)/BUS_ADC_CONV_RATIO) 
#else
#define MAX_VOLTAGE (int16_t)(500/2) /* Virtual sensor conversion factor */
#endif

#ifdef ICS_SENSORS 
#define MAX_CURRENT (MCU_SUPPLY_VOLTAGE/(2*AMPLIFICATION_GAIN))
#else
#define MAX_CURRENT (MCU_SUPPLY_VOLTAGE/(2*RSHUNT*AMPLIFICATION_GAIN))
#endif

#define C1 (int32_t)((((int16_t)F1)*RS)/(LS*TF_REGULATION_RATE))
#define C2 (int32_t) GAIN1
#define C3 (int32_t)((((int16_t)F1)*MAX_BEMF_VOLTAGE)/(LS*MAX_CURRENT*TF_REGULATION_RATE))
#define C4 (int32_t) GAIN2
#define C5 (int32_t)((((int16_t)F1)*MAX_VOLTAGE)/(LS*MAX_CURRENT*TF_REGULATION_RATE))

#define FREQ_STARTUP_PWM_STEPS (uint32_t) ((FREQ_START_UP_DURATION * TF_REGULATION_RATE)\
                                                                          /1000u) 
#define FREQ_INC (uint16_t) ((FINAL_START_UP_SPEED*POLE_PAIR_NUM*65536u/60u)\
                                                        /FREQ_STARTUP_PWM_STEPS)
#define I_STARTUP_PWM_STEPS (uint32_t) ((I_START_UP_DURATION * TF_REGULATION_RATE)/1000u) 
#define I_INC (uint16_t)((FINAL_I_STARTUP -FIRST_I_STARTUP)*1024u/I_STARTUP_PWM_STEPS)
#define PERCENTAGE_FACTOR    (uint16_t)(VARIANCE_THRESHOLD*128u)      
#define OBS_MINIMUM_SPEED        (uint16_t) (OBS_MINIMUM_SPEED_RPM/6u)

/*********************** OBSERVER + CORDIC PARAMETERS *************************/
#define CORD_C1 (int32_t)((((int16_t)CORD_F1)*RS)/(LS*TF_REGULATION_RATE))
#define CORD_C2 (int32_t) CORD_GAIN1
#define CORD_C3 (int32_t)((((int16_t)CORD_F1)*MAX_BEMF_VOLTAGE)/(LS*MAX_CURRENT\
                                                           *TF_REGULATION_RATE))
#define CORD_C4 (int32_t) CORD_GAIN2
#define CORD_C5 (int32_t)((((int16_t)CORD_F1)*MAX_VOLTAGE)/(LS*MAX_CURRENT*\
                                                          TF_REGULATION_RATE))
#define CORD_PERCENTAGE_FACTOR    (uint16_t)(CORD_VARIANCE_THRESHOLD*128u)      
#define CORD_MINIMUM_SPEED        (uint16_t) (CORD_MINIMUM_SPEED_RPM/6u)
/**************************   VOLTAGE CONVERSIONS  ****************************/
#define BUS_ADC_CONV_RATIO       VBUS_PARTITIONING_FACTOR

#define OVERVOLTAGE_THRESHOLD_d   (uint16_t)(OV_VOLTAGE_THRESHOLD_V*65535/\
                                  (MCU_SUPPLY_VOLTAGE/VBUS_PARTITIONING_FACTOR))
#define UNDERVOLTAGE_THRESHOLD_d  (uint16_t)((UD_VOLTAGE_THRESHOLD_V*65535)/\
                                  ((uint16_t)(MCU_SUPPLY_VOLTAGE/\
                                                           BUS_ADC_CONV_RATIO)))
#define INT_SUPPLY_VOLTAGE          (uint16_t)(65536/MCU_SUPPLY_VOLTAGE)

#define DELTA_TEMP_THRESHOLD        (OV_TEMPERATURE_THRESHOLD_C- T0_C)
#define DELTA_V_THRESHOLD           (dV_dT * DELTA_TEMP_THRESHOLD)
#define OV_TEMPERATURE_THRESHOLD_d  ((V0_V + DELTA_V_THRESHOLD)*INT_SUPPLY_VOLTAGE)

#define DELTA_TEMP_HYSTERESIS        (OV_TEMPERATURE_HYSTERESIS_C)
#define DELTA_V_HYSTERESIS           (dV_dT * DELTA_TEMP_HYSTERESIS)
#define OV_TEMPERATURE_HYSTERESIS_d  (DELTA_V_HYSTERESIS*INT_SUPPLY_VOLTAGE)
														  														  
/*************************  PWM IDLE STATES AND POLARITY  *********************/														  
#define H_ACTIVE_HIGH    0x0000u //TIM_OCPolarity_High
#define H_ACTIVE_LOW     0x0002u //TIM_OCPolarity_Low
#define L_ACTIVE_HIGH    0x0000u  //TIM_OCNPolarity_High
#define L_ACTIVE_LOW     0x0008u  //TIM_OCNPolarity_Low 

#define DOUT_ACTIVE_HIGH   DOutputActiveHigh
#define DOUT_ACTIVE_LOW    DOutputActiveLow

#define EMSTOP_ACTIVE_HIGH    TIM_Break1Polarity_High
#define EMSTOP_ACTIVE_LOW     TIM_Break1Polarity_Low
#define EMSTOP2_ACTIVE_HIGH   TIM_Break2Polarity_High
#define EMSTOP2_ACTIVE_LOW    TIM_Break2Polarity_Low

#if (HIGH_SIDE_IDLE_STATE == TURN_OFF)
#if (PHASE_UH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_VH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_WH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE != TURN_OFF)
#error "Error: HIGH_SIDE_IDLE_STATE in Driver parameters.h must be TURN_OFF."
#endif

#if !defined(HIGH_SIDE_BRAKE_STATE)
#define HIGH_SIDE_BRAKE_STATE TURN_OFF
#endif

#if (HIGH_SIDE_BRAKE_STATE == TURN_OFF)
#if (PHASE_UH_POLARITY == H_ACTIVE_HIGH)
#define BRAKE_UH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define BRAKE_UH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_BRAKE_STATE = TURN_ON */
#if	(PHASE_UH_POLARITY == H_ACTIVE_HIGH)
#define BRAKE_UH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define BRAKE_UH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_BRAKE_STATE == TURN_OFF)
#if	(PHASE_VH_POLARITY == H_ACTIVE_HIGH)
#define BRAKE_VH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define BRAKE_VH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_BRAKE_STATE = TURN_ON */
#if	(PHASE_VH_POLARITY == H_ACTIVE_HIGH)
#define BRAKE_VH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define BRAKE_VH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_BRAKE_STATE == TURN_OFF)
#if	(PHASE_WH_POLARITY == H_ACTIVE_HIGH)
#define BRAKE_WH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define BRAKE_WH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_BRAKE_STATE = TURN_ON */
#if	(PHASE_WH_POLARITY == H_ACTIVE_HIGH)
#define BRAKE_WH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define BRAKE_WH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

