KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x.h
#ifdef MAX_MODULATION_93_PER_CENT
#define START_INDEX     55
#define MAX_MODULE      30473   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*93%
#define MMITABLE {\
32437,32275,31959,31651,31353,31207,30920,30642,30371,30107,\
29977,29723,29476,29234,29116,28883,28655,28433,28324,28110,\
27900,27695,27594,27395,27201,27011,26917,26733,26552,26375,\
26202,26116,25948,25783,25621,25541,25383,25228,25076,25001,\
24854,24708,24565,24495,24356,24219,24084,24018,23887,23758,\
23631,23506,23444,23322,23202,23083,23025,22909,22795,22683,\
22627,22517,22409,22302,22250,22145,22042,21941,21890,21791,\
21693,21596,21500\
}
#endif


#ifdef MAX_MODULATION_94_PER_CENT
#define START_INDEX     56
#define MAX_MODULE      30800   //root(Vd^2+Vq^2) <= MAX_MODULE = 32767*94%
#define MMITABLE {\
32607,32293,31988,31691,31546,31261,30984,30714,30451,30322,\
30069,29822,29581,29346,29231,29004,28782,28565,28353,28249,\
28044,27843,27647,27455,27360,27174,26991,26812,26724,26550,\
26380,26213,26049,25968,25808,25652,25498,25347,25272,25125,\
24981,24839,24699,24630,24494,24360,24228,24098,24034,23908,\
23783,23660,23600,23480,23361,23245,23131,23074,22962,22851,\
22742,22635,22582,22477,22373,22271,22170,22120,22021,21924,\
21827,21732\
}
#endif


#ifdef MAX_MODULATION_95_PER_CENT
#define START_INDEX     57
#define MAX_MODULE      31128   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*95%
#define MMITABLE {\
32613,32310,32016,31872,31589,31314,31046,30784,30529,30404,\
30158,29919,29684,29456,29343,29122,28906,28695,28488,28285,\
28186,27990,27798,27610,27425,27245,27155,26980,26808,26639,\
26473,26392,26230,26072,25917,25764,25614,25540,25394,25250,\
25109,24970,24901,24766,24633,24501,24372,24245,24182,24058,\
23936,23816,23697,23580,23522,23408,23295,23184,23075,23021,\
22913,22808,22703,22600,22499,22449,22349,22251,22154,22059,\
21964\
}
#endif


#ifdef MAX_MODULATION_96_PER_CENT
#define START_INDEX     58
#define MAX_MODULE      31456   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*96%
#define MMITABLE {\
32619,32472,32184,31904,31631,31365,31106,30853,30728,30484,\
30246,30013,29785,29563,29345,29238,29028,28822,28620,28423,\
28229,28134,27946,27762,27582,27405,27231,27061,26977,26811,\
26649,26489,26332,26178,26027,25952,25804,25659,25517,25376,\
25238,25103,25035,24903,24772,24644,24518,24393,24270,24210,\
24090,23972,23855,23741,23627,23516,23461,23352,23244,23138,\
23033,22930,22828,22777,22677,22579,22481,22385,22290,22196\
}
#endif


#ifdef MAX_MODULATION_97_PER_CENT
#define START_INDEX     60
#define MAX_MODULE      31783   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*97%
#define MMITABLE {\
32483,32206,31936,31672,31415,31289,31041,30799,30563,30331,\
30105,29884,29668,29456,29352,29147,28947,28750,28557,28369,\
28183,28002,27824,27736,27563,27393,27226,27062,26901,26743,\
26588,26435,26360,26211,26065,25921,25780,25641,25504,25369,\
25236,25171,25041,24913,24788,24664,24542,24422,24303,24186,\
24129,24015,23902,23791,23681,23573,23467,23362,23258,23206,\
23105,23004,22905,22808,22711,22616,22521,22429\
}
#endif


#ifdef MAX_MODULATION_98_PER_CENT
#define START_INDEX     61
#define MAX_MODULE      32111   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*98%
#define MMITABLE {\
32494,32360,32096,31839,31587,31342,31102,30868,30639,30415,\
30196,29981,29771,29565,29464,29265,29069,28878,28690,28506,\
28325,28148,27974,27803,27635,27470,27309,27229,27071,26916,\
26764,26614,26467,26322,26180,26039,25901,25766,25632,25500,\
25435,25307,25180,25055,24932,24811,24692,24574,24458,24343,\
24230,24119,24009,23901,23848,23741,23637,23533,23431,23331,\
23231,23133,23036,22941,22846,22753,22661\
}
#endif


#ifdef MAX_MODULATION_99_PER_CENT
#define START_INDEX     62
#define MAX_MODULE      32439   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*99%
#define MMITABLE {\
32635,32375,32121,31873,31631,31394,31162,30935,30714,30497,\
30284,30076,29872,29672,29574,29380,29190,29003,28820,28641,\
28464,28291,28122,27955,27791,27630,27471,27316,27163,27012,\
26864,26718,26575,26434,26295,26159,26024,25892,25761,25633,\
25569,25444,25320,25198,25078,24959,24842,24727,24613,24501,\
24391,24281,24174,24067,23963,23859,23757,23656,23556,23458,\
23361,23265,23170,23077,22984,22893\
}
#endif


#ifdef MAX_MODULATION_100_PER_CENT
#define START_INDEX     63
#define MAX_MODULE      32767   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*100%
#define MMITABLE {\
32767,32390,32146,31907,31673,31444,31220,31001,30787,30577,30371,\
30169,29971,29777,29587,29400,29217,29037,28861,28687,28517,\
28350,28185,28024,27865,27709,27555,27404,27256,27110,26966,\
26824,26685,26548,26413,26280,26149,26019,25892,25767,25643,\
25521,25401,25283,25166,25051,24937,24825,24715,24606,24498,\
24392,24287,24183,24081,23980,23880,23782,23684,23588,23493,\
23400,23307,23215,23125\
}
#endif

/*************** PI divisor  ***************/
#if (LOG2(SP_KPDIV)==-1)
  #error "Error: SP_KPDIV defined in Drive parameters.h must be power of two."
#else
  #define SP_KPDIV_LOG LOG2(SP_KPDIV)
#endif

#if (LOG2(SP_KIDIV)==-1)
  #error "Error: SP_KIDIV defined in Drive parameters.h must be power of two."
#else
  #define SP_KIDIV_LOG LOG2(SP_KIDIV)
#endif

#if (LOG2(SP_KDDIV)==-1)
  #error "Error: SP_KDDIV defined in Drive parameters.h must be power of two."
#else
  #define SP_KDDIV_LOG LOG2(SP_KDDIV)
#endif

#if (LOG2(TF_KPDIV)==-1)
  #error "Error: TF_KPDIV defined in Drive parameters.h must be power of two."
#else
  #define TF_KPDIV_LOG LOG2(TF_KPDIV)
#endif

#if (LOG2(TF_KIDIV)==-1)
  #error "Error: TF_KIDIV defined in Drive parameters.h must be power of two."
#else
  #define TF_KIDIV_LOG LOG2(TF_KIDIV)
#endif

#if (LOG2(TF_KDDIV)==-1)
  #error "Error: TF_KDDIV defined in Drive parameters.h must be power of two."
#else
  #define TF_KDDIV_LOG LOG2(TF_KDDIV)
#endif

#if (LOG2(FW_KPDIV)==-1)
  #error "Error: FW_KPDIV defined in Drive parameters.h must be power of two."
#else
  #define FW_KPDIV_LOG LOG2(FW_KPDIV)
#endif

#if (LOG2(FW_KIDIV)==-1)
  #error "Error: FW_KIDIV defined in Drive parameters.h must be power of two."
#else
  #define FW_KIDIV_LOG LOG2(FW_KIDIV)
#endif

#define PLL_KPDIV     16384
#define PLL_KIDIV     65535

