KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x.h
#if (USART_SELECTION == USE_USART4)
  #define USART                   UART4
  #define USART_CLK               RCC_APB1Periph_USART4
  #define USART_IRQ               USART4_IRQn
  #define USART_IRQHandler        USART4_IRQHandler
  /* Dummy */
  #define USART_GPIO_REMAP      GPIO_NoRemap_USARTx
#endif

#if (USART_SELECTION == USE_USART5)
  #define USART                   UART5
  #define USART_CLK               RCC_APB1Periph_USART5
  #define USART_IRQ               USART5_IRQn
  #define USART_IRQHandler        USART5_IRQHandler
  /* Dummy */
  #define USART_GPIO_REMAP      GPIO_NoRemap_USARTx
#endif

#define NVIC_USART_INIT_STR \
const NVIC_InitTypeDef NVICInitHW_str =\
{\
  USART_IRQ,  /* NVIC_IRQChannel */\
  USART_PRE_EMPTION_PRIORITY,            /* NVIC_IRQChannelPreemptionPriority */\
  USART_SUB_PRIORITY,            /* NVIC_IRQChannelSubPriority */\
  (FunctionalState)(ENABLE)        /* NVIC_IRQChannelCmd */\
};

/****** Prepares the UI configurations according the MCconfxx settings ********/
#ifdef LCD_FUNCTIONALITY
  #define LCD_ENABLE |OPT_LCD
#else
  #define LCD_ENABLE 
#endif

#ifdef SERIAL_COMMUNICATION
  #define COM_ENABLE |OPT_COM
#else
  #define COM_ENABLE
#endif

#ifdef DAC_FUNCTIONALITY
  
  #define DAC_ENABLE |OPT_DAC
  #define DAC_OPTION OPT_DACF3
  #define DAC_OP_ENABLE |UI_CFGOPT_DAC
#else
  #define DAC_ENABLE
  #define DAC_OP_ENABLE
#endif

/* Motor 1 settings */
#ifdef FLUX_WEAKENING
  #define FW_ENABLE |UI_CFGOPT_FW
#else
  #define FW_ENABLE
#endif

#ifdef DIFFERENTIAL_TERM_ENABLED
  #define DIFFTERM_ENABLE |UI_CFGOPT_SPEED_KD|UI_CFGOPT_Iq_KD|UI_CFGOPT_Id_KD
#else
  #define DIFFTERM_ENABLE
#endif

/* Sensors setting */
#ifdef STATE_OBSERVER_PLL
  #define MAIN_SCFG UI_SCODE_STO_PLL
#endif

#ifdef STATE_OBSERVER_CORDIC
  #define MAIN_SCFG UI_SCODE_STO_CR
#endif

#ifdef AUX_STATE_OBSERVER_PLL
  #define AUX_SCFG UI_SCODE_STO_PLL
#endif

#ifdef AUX_STATE_OBSERVER_CORDIC
  #define AUX_SCFG UI_SCODE_STO_CR
#endif

#ifdef ENCODER
  #define MAIN_SCFG UI_SCODE_ENC
#endif

#ifdef HFINJECTION
  #define MAIN_SCFG UI_SCODE_HFINJ
#endif

#ifdef VIEW_ENCODER_FEEDBACK
  #define AUX_SCFG UI_SCODE_ENC
#endif

#ifdef HALL_SENSORS
  #define MAIN_SCFG UI_SCODE_HALL
#endif

#ifdef VIEW_HALL_FEEDBACK
  #define AUX_SCFG UI_SCODE_HALL
#endif

#ifndef AUX_SCFG
#define AUX_SCFG 0x0
#endif

#if defined(PLLTUNING)
  #define PLLTUNING_ENABLE |UI_CFGOPT_PLLTUNING
#else
  #define PLLTUNING_ENABLE
#endif

#if defined(PFC_ENABLED)
  #define UI_CFGOPT_PFC_ENABLE |UI_CFGOPT_PFC
#else
  #define UI_CFGOPT_PFC_ENABLE
#endif

/******************************************************************************* 
  * UI configurations settings. It can be manually overwritten if special 
  * configuartion is required. 
*******************************************************************************/

/* Base configuration of UI */
#define UI_INIT_CFG ( OPT_NONE LCD_ENABLE COM_ENABLE DAC_ENABLE )

/* Specific options of UI */
#define UI_CONFIG_M1 ( UI_CFGOPT_NONE DAC_OP_ENABLE FW_ENABLE DIFFTERM_ENABLE \
  | (MAIN_SCFG << MAIN_SCFG_POS) | (AUX_SCFG << AUX_SCFG_POS) | UI_CFGOPT_SETIDINSPDMODE PLLTUNING_ENABLE UI_CFGOPT_PFC_ENABLE | UI_CFGOPT_PLLTUNING)

#ifdef SINGLEDRIVE
  #define UI_CONFIG_M2
#endif

#define OCP_OFFSET (((float)(OCP_V)) * (OCP_R1/(OCP_R1 + OCP_R2)))
#define OCP_TH_V (OCP_OFFSET + ((float)(RSHUNT)*OCP_THRESHOLD)*(OCP_R2/(OCP_R1+OCP_R2)))
#define OCP_DAC_VREF (uint16_t)((OCP_TH_V * DAC_MAX_DIGIT)/DAC_VMAX)
#define DAC_VMAX ((float)(MCU_SUPPLY_VOLTAGE))
#define DAC_MAX_DIGIT 65536.0f

#define OVP_DAC_VREF (uint16_t)(((float)(OV_VOLTAGE_THRESHOLD_V)*(float)(VBUS_PARTITIONING_FACTOR)*DAC_MAX_DIGIT)/DAC_VMAX)

#define OPAMP1_InvertingInput_PC5       OPAMP_InvertingInput_IO1
#define OPAMP1_InvertingInput_PA3       OPAMP_InvertingInput_IO2
#define OPAMP1_InvertingInput_PGA       OPAMP_InvertingInput_PGA
#define OPAMP1_InvertingInput_FOLLOWER  OPAMP_InvertingInput_Vout
#define OPAMP2_InvertingInput_PC5       OPAMP_InvertingInput_IO1
#define OPAMP2_InvertingInput_PA5       OPAMP_InvertingInput_IO2
#define OPAMP2_InvertingInput_PGA       OPAMP_InvertingInput_PGA
#define OPAMP2_InvertingInput_FOLLOWER  OPAMP_InvertingInput_Vout
#define OPAMP3_InvertingInput_PB10      OPAMP_InvertingInput_IO1
#define OPAMP3_InvertingInput_PB2       OPAMP_InvertingInput_IO2
#define OPAMP3_InvertingInput_PGA       OPAMP_InvertingInput_PGA
#define OPAMP3_InvertingInput_FOLLOWER  OPAMP_InvertingInput_Vout
#define OPAMP4_InvertingInput_PB10      OPAMP_InvertingInput_IO1
#define OPAMP4_InvertingInput_PD8       OPAMP_InvertingInput_IO2
#define OPAMP4_InvertingInput_PGA       OPAMP_InvertingInput_PGA
#define OPAMP4_InvertingInput_FOLLOWER  OPAMP_InvertingInput_Vout

#define OPAMP1_NonInvertingInput_PA7    OPAMP_NonInvertingInput_IO1
#define OPAMP1_NonInvertingInput_PA5    OPAMP_NonInvertingInput_IO2
#define OPAMP1_NonInvertingInput_PA3    OPAMP_NonInvertingInput_IO3
#define OPAMP1_NonInvertingInput_PA1    OPAMP_NonInvertingInput_IO4
#define OPAMP2_NonInvertingInput_PD14   OPAMP_NonInvertingInput_IO1
#define OPAMP2_NonInvertingInput_PB14   OPAMP_NonInvertingInput_IO2
#define OPAMP2_NonInvertingInput_PB0    OPAMP_NonInvertingInput_IO3
#define OPAMP2_NonInvertingInput_PA7    OPAMP_NonInvertingInput_IO4
#define OPAMP3_NonInvertingInput_PB13   OPAMP_NonInvertingInput_IO1
#define OPAMP3_NonInvertingInput_PA5    OPAMP_NonInvertingInput_IO2
#define OPAMP3_NonInvertingInput_PA1    OPAMP_NonInvertingInput_IO3
#define OPAMP3_NonInvertingInput_PB0    OPAMP_NonInvertingInput_IO4
#define OPAMP4_NonInvertingInput_PD11   OPAMP_NonInvertingInput_IO1
#define OPAMP4_NonInvertingInput_PB11   OPAMP_NonInvertingInput_IO2
#define OPAMP4_NonInvertingInput_PA4    OPAMP_NonInvertingInput_IO3
#define OPAMP4_NonInvertingInput_PB13   OPAMP_NonInvertingInput_IO4

#define OPAMP1_PGAConnect_PC5  OPAMP_PGAConnect_IO1
#define OPAMP1_PGAConnect_PA3  OPAMP_PGAConnect_IO2
#define OPAMP2_PGAConnect_PC5  OPAMP_PGAConnect_IO1
#define OPAMP2_PGAConnect_PA5  OPAMP_PGAConnect_IO2
#define OPAMP3_PGAConnect_PB10 OPAMP_PGAConnect_IO1
#define OPAMP3_PGAConnect_PB2  OPAMP_PGAConnect_IO2
#define OPAMP4_PGAConnect_PB10 OPAMP_PGAConnect_IO1
#define OPAMP4_PGAConnect_PD8  OPAMP_PGAConnect_IO2

