KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x.h
#define COMP1_InvertingInput_PA0    COMP_InvertingInput_IO1
#define COMP2_InvertingInput_PA2    COMP_InvertingInput_IO1
#define COMP3_InvertingInput_PD15   COMP_InvertingInput_IO1
#define COMP3_InvertingInput_PB12   COMP_InvertingInput_IO2
#define COMP4_InvertingInput_PE8    COMP_InvertingInput_IO1
#define COMP4_InvertingInput_PB2    COMP_InvertingInput_IO2
#define COMP5_InvertingInput_PD13   COMP_InvertingInput_IO1
#define COMP5_InvertingInput_PB10   COMP_InvertingInput_IO2
#define COMP6_InvertingInput_PD10   COMP_InvertingInput_IO1
#define COMP6_InvertingInput_PB15   COMP_InvertingInput_IO2
#define COMP7_InvertingInput_PC0    COMP_InvertingInput_IO1

#define COMPX_InvertingInput_DAC1      COMP_InvertingInput_DAC1
#define COMPX_InvertingInput_DAC2      COMP_InvertingInput_DAC2
#define COMPX_InvertingInput_VREF      COMP_InvertingInput_VREFINT
#define COMPX_InvertingInput_VREF_1_4  COMP_InvertingInput_1_4VREFINT
#define COMPX_InvertingInput_VREF_1_2  COMP_InvertingInput_1_2VREFINT
#define COMPX_InvertingInput_VREF_3_4  COMP_InvertingInput_3_4VREFINT

#define COMP1_NonInvertingInput_PA1   COMP_NonInvertingInput_IO1
#define COMP2_NonInvertingInput_PA3   COMP_NonInvertingInput_IO2
#define COMP2_NonInvertingInput_PA7   COMP_NonInvertingInput_IO1
#define COMP3_NonInvertingInput_PB14  COMP_NonInvertingInput_IO1
#define COMP3_NonInvertingInput_PD14  COMP_NonInvertingInput_IO2
#define COMP4_NonInvertingInput_PB0   COMP_NonInvertingInput_IO1
#define COMP4_NonInvertingInput_PE7   COMP_NonInvertingInput_IO2
#define COMP5_NonInvertingInput_PB13  COMP_NonInvertingInput_IO2
#define COMP5_NonInvertingInput_PD12  COMP_NonInvertingInput_IO1
#define COMP6_NonInvertingInput_PB11  COMP_NonInvertingInput_IO2
#define COMP6_NonInvertingInput_PD11  COMP_NonInvertingInput_IO1
#define COMP7_NonInvertingInput_PC1   COMP_NonInvertingInput_IO2
#define COMP7_NonInvertingInput_PA0   COMP_NonInvertingInput_IO1

#if (USE_INTERNAL_OPAMP == ENABLE)
#define R3_4_OPAMPPARAMSM1 &R3_4_F30XOPAMPParamsM1
#define R3_2_OPAMPPARAMSM1 &R3_2_F30XOPAMPParamsM1
#define R1_OPAMPPARAMSM1   &R1_F30XOPAMPParamsM1
#else
#define R3_4_OPAMPPARAMSM1 MC_NULL
#define R3_2_OPAMPPARAMSM1 MC_NULL
#define R1_OPAMPPARAMSM1   MC_NULL
#endif

#if (INTERNAL_OVERCURRENTPROTECTION == ENABLE)
#define OCPA_COMPPARAMSM1 &R3_F30XOCPACOMPParamsM1
#define OCPB_COMPPARAMSM1 &R3_F30XOCPBCOMPParamsM1
#define OCPC_COMPPARAMSM1 &R3_F30XOCPCCOMPParamsM1
#define OCP_COMPPARAMSM1  &R1_F30XOCPCOMPParamsM1
#else
#define OCPA_COMPPARAMSM1 MC_NULL
#define OCPB_COMPPARAMSM1 MC_NULL
#define OCPC_COMPPARAMSM1 MC_NULL
#define OCP_COMPPARAMSM1  MC_NULL
#endif

#if (INTERNAL_OVERVOLTAGEPROTECTION == ENABLE)
#define OVP_COMPPARAMSM1 &F30XOVPCOMPParamsM1
#else
#define OVP_COMPPARAMSM1 MC_NULL
#endif

#if (defined(DUALDRIVE) && (defined(SINGLE_SHUNT) || defined(THREE_SHUNT_INDEPENDENT_RESOURCES)))
#define ADC1_2_DUALDRIVEFIFOUPDATE TSK_DualDriveFIFOUpdate(Exec_IRQ_Handler(MC_IRQ_PWMNCURRFDBK_1,TIMx_UP_M1_IRQFlag))
#define ADC3_DUALDRIVEFIFOUPDATE TSK_DualDriveFIFOUpdate(Exec_IRQ_Handler(MC_IRQ_PWMNCURRFDBK_2,TIMx_UP_M2_IRQFlag))
#else
#define ADC1_2_DUALDRIVEFIFOUPDATE
#define ADC3_DUALDRIVEFIFOUPDATE
#endif

#endif /*__PARAMETERS_CONVERSION_F30X_H*/

/******************* (C) COPYRIGHT 2014 STMicroelectronics *****END OF FILE****/
